bookers2-debug/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def index
		@book = Book.new
		@users = User.all
		@user = User.find(current_user.id)